duvallee/STM32F746Discovery/Src/main.c
   MX_GPIO_Init();
   MX_DMA_Init();
   MX_FMC_Init();
   MX_USART6_UART_Init();
   MX_TIM6_Init();
   MX_LTDC_Init();
   MX_DMA2D_Init();
   MX_TIM1_Init();
   MX_TIM12_Init();

   // init lcd log
   lcd_log_Init(g_FrameBuffer, RK043FN48H_WIDTH, RK043FN48H_HEIGHT, LTDC_PIXEL_FORMAT_ARGB8888);
   g_start_log                                           = 1;

#if 0
   // --------------------------------------------------------------------------
   // init software timer
   init_software_timer();
#endif

   // --------------------------------------------------------------------------
   debug_output_info("===================================================== \r\n");
   debug_output_info("BUILD   : %s %s \r\n", __DATE__, __TIME__);
   debug_output_info("VERSION : ver0.1.4 \r\n");
   debug_output_info("===================================================== \r\n");

   // init touch driver
   touch_init();

   // --------------------------------------------------------------------------
   HAL_GPIO_WritePin(GPIOI, GPIO_PIN_12, GPIO_PIN_SET);     // Display on
   HAL_GPIO_WritePin(GPIOK, GPIO_PIN_3, GPIO_PIN_SET);      // Backlight on

   // --------------------------------------------------------------------------
   HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
   HAL_TIM_PWM_Start(&htim12, TIM_CHANNEL_1);

   // --------------------------------------------------------------------------
   // Initialize for LwIP
   MX_LWIP_Init();

   // --------------------------------------------------------------------------
   /* Thread definition for tcp server */
   osThreadDef(tcp_server_task, network_tcp_server_task, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 2);
   if (osThreadCreate(osThread(tcp_server_task), (void *) NULL) == NULL)
   {
      debug_output_error("Can't create thread : network_tcp_server_task !!!");
   }

   // --------------------------------------------------------------------------
   /* Thread definition for communication of tcp */
   osThreadDef(tcp_task, network_tcp_task, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 2);
   if (osThreadCreate(osThread(tcp_task), (void *) NULL) == NULL)
   {
      debug_output_error("Can't create thread : tcp_task !!!");
   }



   // --------------------------------------------------------------------------
   /* Thread definition for udp server */
   osThreadDef(udp_server_task, network_udp_server_task, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 2);
   if (osThreadCreate(osThread(udp_server_task), (void *) NULL) == NULL)
   {
      debug_output_error("Can't create thread : network_udp_server_task !!!");
   }

   // --------------------------------------------------------------------------
   /* Thread 1 definition */
   osThreadDef(servo_task_1, test_servo_1_task, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);
   osThreadDef(servo_task_2, test_servo_2_task, osPriorityNormal, 0, configMINIMAL_STACK_SIZE);

   /* Start thread 1 */
   if (osThreadCreate(osThread(servo_task_1), (void *) &htim1) == NULL)
   {
      debug_output_error("Can't create thread : test_servo_1_task !!!");
   }

   /* Start thread 2 */
   if (osThreadCreate(osThread(servo_task_2), (void *) &htim12) == NULL)
   {
      debug_output_error("Can't create thread : test_servo_2_task !!!");
   }

   // --------------------------------------------------------------------------
   /* Start scheduler */
   osKernelStart();

   for(;;);

}


/* --------------------------------------------------------------------------
 * Name : HAL_SYSTICK_Callback()
 *
 *
 * -------------------------------------------------------------------------- */
void HAL_SYSTICK_Callback(void)
{
   g_System_Start_Milli_Second++;

   if (g_System_Start_Milli_Second >= MILLI_SECOND)
   {
      g_System_Start_Second++;
      g_System_Start_Milli_Second                        = 0;
   }

   if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0) == 0)
   {
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, 1);
   }
   else
   {
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, 0);
   }
}

#if defined(USE_CLOCK_INTERNAL)
/* --------------------------------------------------------------------------
 * Name : SystemClock_Config()
 *        System Clock Configuration
 *
 * -------------------------------------------------------------------------- */
void SystemClock_Config(void)
{
   RCC_OscInitTypeDef RCC_OscInitStruct;
   RCC_ClkInitTypeDef RCC_ClkInitStruct;
   RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

   /**Configure the main internal regulator output voltage 
   */
   __HAL_RCC_PWR_CLK_ENABLE();
   __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);

   /**Initializes the CPU, AHB and APB busses clocks 
   */
   RCC_OscInitStruct.OscillatorType                      = RCC_OSCILLATORTYPE_HSI;
   RCC_OscInitStruct.HSIState                            = RCC_HSI_ON;
   RCC_OscInitStruct.HSICalibrationValue                 = 16;
   RCC_OscInitStruct.PLL.PLLState                        = RCC_PLL_NONE;
   if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }

   /**Initializes the CPU, AHB and APB busses clocks 
   */
   RCC_ClkInitStruct.ClockType                           = RCC_CLOCKTYPE_HCLK       |
                                                           RCC_CLOCKTYPE_SYSCLK     |
                                                           RCC_CLOCKTYPE_PCLK1      |
                                                           RCC_CLOCKTYPE_PCLK2;
   RCC_ClkInitStruct.SYSCLKSource                        = RCC_SYSCLKSOURCE_HSI;
   RCC_ClkInitStruct.AHBCLKDivider                       = RCC_SYSCLK_DIV1;
   RCC_ClkInitStruct.APB1CLKDivider                      = RCC_HCLK_DIV1;
   RCC_ClkInitStruct.APB2CLKDivider                      = RCC_HCLK_DIV1;

   if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
   {
      _Error_Handler(__FILE__, __LINE__);
   }

